# coding: utf-8

def trunk1():
    trunk1 = "横隔膜	腰椎部：第1〜4腰椎の椎体前面、第12肋骨尖端,肋骨部：第7〜12肋軟骨の内面,胸骨部：胸骨の剣状突起後面	腱中心	横隔神経	吸気筋（収縮すると胸腔が広がり、息を吸いこむ）"
    return trunk1


def trunk2():
    trunk2 = "腹直筋	恥骨結合・恥骨	第5〜7肋軟骨前面・剣状突起前面	肋間神経	体幹を前屈\n錐体筋	恥骨	白線	肋下神経・腸骨下腹神経	腹直筋の働きを助ける\n腰方形筋	腸骨稜	第12肋骨	腰神経叢	腰椎の側屈、両側が同時に働けば腰椎の後屈"
    return trunk2


def trunk3():
    
    trunk3 = "小後頭直筋	第1頚椎（環椎）の後結節	後頭骨の下項線の内側1/3部	後頭下神経(第1頚神経の後枝で学名のある脊髄神経後枝)	頭を後ろに引いて直立位に保持する。一側が働けば同側に曲がる。また下頭斜筋は同側に回す\n大後頭直筋	第2頚椎（軸椎）の棘突起	後頭骨の下項線の中央部	後頭下神経(第1頚神経の後枝で学名のある脊髄神経後枝)	頭を後ろに引いて直立位に保持する。一側が働けば同側に曲がる。また下頭斜筋は同側に回す\n上頭斜筋	第1頚椎（環椎）の横突起	上項線と下項線との間で頭半棘筋の外側の後頭骨	後頭下神経(第1頚神経の後枝で学名のある脊髄神経後枝)	頭を後ろに引いて直立位に保持する。一側が働けば同側に曲がる。また下頭斜筋は同側に回す\n下頭斜筋	第2頚椎（軸椎）の棘突起	第1頚椎（環椎）の横突起	後頭下神経(第1頚神経の後枝で学名のある脊髄神経後枝)	頭を後ろに引いて直立位に保持する。一側が働けば同側に曲がる。また下頭斜筋は同側に回す"
    
    
    return trunk3

def scapula():
    scapula = "僧帽筋	外後頭隆起・項靭帯・棘突起（第7頚椎＋全胸椎）	肩甲棘・肩峰・鎖骨外側1/3	副神経・第2〜4頚神経	上部は肩甲骨と鎖骨の挙上、中部は肩甲骨を内方に引き固定、下部は肩甲骨を回転し、上腕の挙上を助ける\n広背筋	棘突起（第7胸椎以下の胸椎・腰椎・仙骨）・腸骨稜・下位（第9〜12）肋骨・肩甲骨下角	小結節稜	胸背神経	肩関節の内転・内旋さらに背部へ回るように働く\n肩甲挙筋	第1〜4頚椎横突起	肩甲骨上角	肩甲背神経	肩甲骨を上内方に引く\n小菱形筋	第6・7胸椎棘突起	肩甲骨内側縁上部	肩甲背神経	肩甲骨を上内方に引く\n大菱形筋	第1〜4胸椎棘突起	肩甲骨内側縁	肩甲背神経	肩甲骨を上内方に引く"
    return scapula

def UE1():
    UE1="烏口腕筋	烏口突起	上腕骨体	筋皮神経	肩関節の屈曲・内転\n上腕二頭筋	長頭：関節上結節、短頭：烏口突起	橈骨粗面	筋皮神経	肘関節の屈曲・前腕の回外\n上腕筋	上腕骨前面の下半部	尺骨粗面	筋皮神経	肘関節の屈曲\n上腕三頭筋	長頭：関節下結節、外側頭：上腕骨外側面、内側頭：上腕骨後面	肘頭	橈骨神経	肘関節の伸展\n肘筋	外側上顆	尺骨上部後面	橈骨神経	肘関節の伸展\n円回内筋	上腕頭：内側上顆、尺骨頭：鈎状突起	橈骨中部の外側面（円回内筋粗面）	正中神経	前腕の回内と肘関節の屈曲\n橈側手根屈筋	内側上顆	第2・3中手骨底	正中神経	手関節の屈曲・外転（橈屈）\n長掌筋	内側上顆	手掌腱膜	正中神経	手関節の屈曲\n浅指屈筋	上腕尺骨頭：内側上顆・尺骨粗面、橈骨頭：橈骨上部の前面	第2〜5中節骨底	尺骨神経	第2〜5指のMP関節およびPIP関節を屈曲\n尺側手根屈筋	上腕頭：内側上顆、尺骨頭：尺骨上半部の後縁	豆状骨（豆鈎靱帯を介して有鈎骨まで腱が伸びる）・第5中手骨底	尺骨神経	関節の屈曲と内転（尺屈）"

    return UE1

def UE2():
    UE2="深指屈筋	尺骨前面・前腕骨間膜	第2〜5末節骨底	橈側半は正中神経、尺骨半は尺骨神経	第2〜5指のDIP関節を屈曲\n長母指屈筋	橈骨前面・前腕骨間膜	母指末節骨底	正中神経	母指のMP・IP関節を屈曲\n方形回内筋	尺骨下部前面	橈骨下部前面	正中神経	前腕の回内\n腕橈骨筋	上腕骨下部外側縁	橈骨茎状突起	橈骨神経	肘関節の屈曲＊腕橈骨筋は伸筋群に属しているが、作用は屈筋であることに注意\n長頭側手根伸筋	外側上顆	第2中手骨底	橈骨神経	手関節の伸展（背屈）と外転（橈屈）\n短橈側手根伸筋	外側上顆	第3中手骨底	橈骨神経	手関節の伸展（背屈）と外転（橈屈）\n総指伸筋	外側上顆	第2〜5指の中節骨と末節骨	橈骨神経	手関節の伸展（背屈）と第2〜5指の伸展\n小指伸筋	外側上顆	第5指の指伸筋腱	橈骨神経	第5指の伸展\n尺側手根伸筋	外側上顆・尺骨後面	第5中手骨底	橈骨神経	手関節の伸展と内転（尺屈）\n回外筋	外側上顆・尺骨回外筋稜	橈骨上部外側面	橈骨神経	前腕の回外\n長母指外転筋	橈骨および尺骨の中央部後面・前腕骨間膜	第1中手骨底	橈骨神経	母指の外転\n短母指伸筋	橈骨下部後面・前腕骨間膜	母指基節骨底	橈骨神経	母指のMP関節の伸展\n長母指伸筋	尺骨後面・前腕骨間膜	母指末節骨底	橈骨神経	母指のIP関節の伸展\示指伸筋	尺骨下部孔面・前腕骨間膜	第2指の背側腱膜	橈骨神経	示指の伸展"

    return UE2

def UE3():
    UE3="短母指外転筋	舟状骨・屈筋支帯	母指基節骨底	正中神経	母指の外転\n母指対立筋	大菱形骨・屈筋支帯	第1中手骨体の橈側縁	正中神経	母指の対立運動\n短母指屈筋	浅頭：屈筋支帯、深頭；大・小菱形骨・第2中手骨底	母指基節骨底	浅頭は正中神経、深頭は尺骨神経	母指のMP関節の屈曲\n母指内転筋	横頭：第3中手骨手掌面、斜頭：有頭骨	母指基節骨底	尺骨神経	母指の内転\n短掌筋	手掌腱膜の尺側縁	小指球の皮膚	尺骨神経	小指球の尺側縁の皮膚の緊張\n小指外転筋	豆状骨・屈筋支帯	小指基節骨底	尺骨神経	小指の外転\n短小指屈筋	有鈎骨・屈筋支帯	小指基節骨底	浅頭は正中神経、深頭は尺骨神経	小指のMP関節の屈曲\n小指対立筋	有鈎骨・屈筋支帯	第5中手骨の尺側縁	尺骨神経	小指が母指と向かい合うのを助ける\n虫様筋	4個の円柱状の小筋で、深指屈筋の腱から起こる。第1, 第2は第2, 第3指に至る腱の橈側から、第3, 第4はそれぞれ2頭をもって第3〜第5指に至る腱の相対する側から起こる	扁平な腱となり、それぞれ第2〜5指基節骨底の橈側から指背腱膜に加わって終わる	第1,2は正中神経第3,4は尺骨神経	第2〜5指のMP関節を屈曲させ、IP関節の伸展を助ける\n掌側骨間筋	3個あり、第2中手骨の尺側と第4・5中手骨の橈側	指背腱膜に加わり、それぞれ第2指の基節骨底尺側と第4・5指の基節骨底橈側に終わる	尺骨神経	第3指に全ての指を近づける（指の内転）\n背側骨間筋	4個あり、2頭をもって第1〜5中手骨の対向面より起こる	第1・2背側骨間筋はそれぞれ第2・3指基節骨底の橈側に、第3・4背側骨間筋はそれぞれ第3・4指季節骨の尺側に終わる	尺骨神経	第3指を中心に指を開く（指の外転）"

    return UE3

def trunk4():
    trunk4 = "板状筋	下位（第4〜7）頚椎および上位（第1〜5）胸椎の棘突起	乳様突起（側頭骨）・第1〜2頚椎横突起	脊髄神経後枝	頭および脊柱の背屈と側屈	脊髄神経後枝	頭および脊柱の背屈と側屈\n(脊柱起立筋)腸肋筋	第3〜6肋骨上縁（頚腸肋筋）、下位6本の肋骨の上縁（腰腸肋筋の胸部）、腰背筋膜（腰腸肋筋の腰部）	第4〜6頚椎の横突起（頚腸肋筋）、上位6本の肋骨の肋骨角（胸腸肋筋）、下位6本の肋骨の肋骨角（腰腸肋筋）	脊髄神経後枝	頭および脊柱の背屈と側屈\n(脊柱起立筋)最長筋	上位3胸椎と下位5頚椎の横突起（頭最長筋）、上位4〜5胸椎の横突起（頚最長筋）、第11・12胸椎の棘突起・ほとんどの腰椎・仙骨の後面（胸最長筋）	側頭骨の乳様突起後縁（頭最長筋）、第2〜6頚椎の横突起（頚最長筋）、第3〜12胸椎の横突起と隣接する肋骨（胸最長筋）	脊髄神経後枝	頭および脊柱の背屈と側屈\n(脊柱起立筋)棘筋	頭半棘筋の一部（頭棘筋）、下位2頚椎と上位2胸椎の棘突起（頚棘筋）、下位2胸椎と上位2腰椎の棘突起（胸棘筋）	頚半棘筋の内側縁に合するもの（頭棘筋）、第2〜4頚椎の棘突起（頚棘筋）、第2〜9胸椎の棘突起（胸半棘筋）	脊髄神経後枝	頭および脊柱の背屈と側屈\n(横突棘筋)半棘筋	下位3〜4頚椎棘突起、上位6胸椎の横突起（頭半棘筋）、上位6胸椎の横突起（頚半棘筋）、下位6胸椎の横突起（胸半棘筋）	後頭骨の上項線と下項線の後頭鱗（頭半棘筋）、第2〜6頚椎の棘突起（頚半棘筋）、上位胸椎および下位2頚椎の棘突起（胸半棘筋）	脊髄神経後枝	頭および脊柱の背屈と側屈\n(横突棘筋)多裂筋	第4頚椎から仙骨背面に至る間の横突起	2〜4個上位の棘突起	脊髄神経後枝	頭および脊柱の背屈と側屈\n(横突棘筋)回旋筋	椎骨（環椎を除く）の横突起	1〜2個上位の椎骨の椎弓	脊髄神経後枝	頭および脊柱の背屈と側屈"

    return trunk4

def shoulder1():
    shoulder1 = "棘上筋	棘上窩	大結節	肩甲上神経	肩関節の外転\n棘下筋	棘下窩	大結節	肩甲上神経	肩関節の外旋\n小円筋	肩甲骨外側縁	大結節	腋窩神経	肩関節の外旋\n三角筋	肩甲骨の肩峰・肩甲棘・鎖骨の外側1/3	三角筋粗面	腋窩神経	肩関節の外転（側方挙上）、屈曲（前方挙上）、伸展（後方挙上）\n肩甲下筋	肩甲下窩	小結節	肩甲下神経	肩関節の内旋\n大円筋	肩甲骨下角	小結節稜	肩甲下神経	肩関節の内旋・内転"

    return shoulder1



def leg1():
    leg1 = "腸骨筋	腸骨窩	小転子	大腿神経	股関節の屈曲、下肢を固定すると上半身は前に曲がる\n大腰筋	全腰椎の肋骨突起、第12胸椎〜第4腰椎の椎体と椎間円板	小転子	腰神経叢	股関節の屈曲、下肢を固定すると上半身は前に曲がる\n大殿筋	腸骨外面（後殿筋線より後ろ）、仙骨後面、仙結節靭帯	殿筋粗面、腸脛靭帯	下殿神経	股関節の伸展、腸脛靭帯を緊張させ膝関節を伸展させ直立姿勢を保つ、股関節の外転と外旋\n中殿筋	腸骨外面（前殿筋線と後殿筋線の間）	大転子	上殿神経	股関節の外転、前部の筋は内旋\n小殿筋	腸骨外面（前殿筋線と下殿筋線の間）	大転子	上殿神経	股関節の外転、内旋\n大腿筋膜張筋	上前腸骨棘	腸脛靭帯	上殿神経	股関節の屈曲・外転・内旋、膝関節の伸展・外旋"


    return leg1

def leg2():
    leg2 = "縫工筋	上前腸骨棘	脛骨粗面の内側（鶩足）	大腿神経	股関節の屈曲・外転・外旋、膝関節の屈曲・内旋\n大腿直筋	下前腸骨棘	４つの筋は合して膝蓋骨につき、膝蓋靱帯を経て脛骨粗面に終わる	大腿神経	膝関節の伸展、股関節の屈曲\n外側広筋	粗線外側唇	４つの筋は合して膝蓋骨につき、膝蓋靱帯を経て脛骨粗面に終わる	大腿神経	膝関節の伸展\n中間広筋	大腿骨前面	４つの筋は合して膝蓋骨につき、膝蓋靱帯を経て脛骨粗面に終わる	大腿神経	膝関節の伸展\n内側広筋	粗線内側唇	４つの筋は合して膝蓋骨につき、膝蓋靱帯を経て脛骨粗面に終わる	大腿神経	膝関節の伸展\n膝関節筋	大腿骨下部前面	膝関節包	大腿神経	膝関節の関節包を上方に引く\n恥骨筋	恥骨櫛	恥骨筋線	大腿神経	股関節の内転・屈曲\n長内転筋	恥骨体	粗線内側唇	閉鎖神経	股関節の内転・屈曲\n短内転筋	恥骨下枝	粗線内側唇	閉鎖神経	股関節の内転・屈曲\n大内転筋	恥骨下枝・坐骨枝・坐骨結節	粗線内側唇、内転筋結節	閉鎖神経	股関節の内転、筋の上方は股関節の屈曲、下方は伸展\n薄筋	恥骨下枝	脛骨粗面の内側（鶩足）	閉鎖神経	股関節の内転、膝関節の屈曲・内旋\n外閉鎖筋	閉鎖膜の外面	転子窩	閉鎖神経	股関節の外旋・内転\n(大腿二頭筋)長頭	坐骨結節	腓骨頭	坐骨神経（脛骨神経）	股関節の伸展、膝関節の屈曲・外旋\n(大腿二頭筋)短頭	粗線外側唇	腓骨頭	坐骨神経（総腓骨神経）	膝関節の屈曲・外旋\n半腱様筋	坐骨結節	脛骨粗面の内側（鶩足）	坐骨神経（脛骨神経）	股関節の伸展、膝関節の屈曲・内旋"


    return leg2



def shoulder2():
    shoulder2 = "大胸筋	鎖骨(内側1/2)・胸骨・肋軟骨・腹直筋鞘	上腕骨大結節稜	内側胸筋神経・外側胸筋神経	肩関節の屈曲・内転・内旋\n小胸筋	第2〜5肋骨	肩甲骨烏口突起	内側胸筋神経・外側胸筋神経	呼吸補助筋\n鎖骨下筋	第1肋骨	鎖骨下面	鎖骨下筋神経	鎖骨を下内方に引き、胸鎖関節を保護する\n前鋸筋 	第1〜8肋骨	肩甲骨内側縁	長胸神経	肩甲骨を前に引く。下角を前に引いて肩甲骨を回す"

    return shoulder2